#include<stdio.h>

int main() {
	//int a[5];
	//int	b, c;

	//
	//for (int i = 0; i <= 5; i++) {
	//	scanf("%d", &a[i]); // 0 1 2 3 4 5   6개의 숫자가 들어감
	//}
	//scanf(" %d", &b);  // 한칸 띄우고 성별이 들어감
	//if (b == 1 || b == 2) { // 구분
	//	c = 1900 + (a[0] * 10) + a[1]; // 931123    1993 
	//	c = 2012 - c; // 2012 - 1993 = 20
	//	printf("%d",c); 
	//}
	//else if (b == 3 || b == 4) {
	//	c = 2000 + (a[0] * 10) + a[1]; // 081123 2008   2008 - 2000
	//	c = 2012 - c; // 2012 - 2008 = 4
	//	printf("%d", c);
	//}
	//	

	int a, b;

	scanf("%d %d", &a, &b);

	a = a / 10000; // 93
	if (b <= 2) { // 1 2
		a = 2012 - (a + 1900); // 2012 - 93 + 1990
		printf("%d", a+1);
	}
	else if (b >=3) { // 3  4
		a = 2012 - (a + 2000);
		printf("%d", a+1);
	}
	
		
}
